# Составьте программу, которая запрашивает название государства и его столицы, а затем выводит сообщение:
# Государство - ..., столица - ...

# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_03_02_08.
#
# Выполнил: Буц И.Д.
# Группа: АДЭУ-211
# E-mail: ButsID@mgpu.ru


# Название государства
country = input("Введите название страны:")
capital = input("Введите название столицы:")
print('Государство - {0}, столица - {1} '.format(country, capital))



# --------------
# Пример вывода:
#
# Введите название государства: Россия
# Введите название столицы: Москва
# Государство - Россия, столица - Москва
