# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_04_02_06.
#
# Выполнил: Буц И.Д.
# Группа: АДЭУ-211
# E-mail: ButsID@mgpu.ru

import math
a = float(input("a="))
b = float(input("b="))
c = float(input("c="))


# Расчет дискриминанта
D=(b**2-4*a*c)**1/2
if D>0:
    x1=(round(-b+D/(2*a)))
    x2=(round(b-D/(2*a)))
    print("x1:",x1)
    print("x2:",x2)
elif D == 0:
    x=(round(-b/(2*a)))
    print("x:",x)
elif D<0:
    print("Корней нет")
# Вывод решения в зависимости от значения дискриминанта
# При выводе значений оставьте 1 знак после запятой
# Удалите комментарий и допишите код

# --------------
# Пример вывода:
#
# a = 1
# b = 2
# c = 3
# Решений нет
#
# a = 1
# b = 2
# c = 1
# x = -1.0
#
# a = 1
# b = 3
# c = -4
# x1 = -4.0, x2 = 1.0
