# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_04_02_05.
#
# Выполнил: Буц И.Д.
# Группа: АДЭУ-211
# E-mail: ButsID@mgpu.ru


x = int(input("x:"))
y = int(input("y:"))

if x>0 and y>0:
    print("1-я четверть")
elif x<0 and y<0:
    print("3-я четверть")
elif x>0 and y<0:
    print("4-я четверть")
elif x<0 and y>0:
    print("2-я четверть")

# Удалите комментарий и допишите код

# --------------
# Пример вывода:
#
# Введите координату x: 5
# Введите координату y: 7
# 1-я четверть
