# Программирование на языке высокого уровня (Python).
# https://www.yuripetrov.ru/edu/python
# Задание task_04_02_02.
#
# Выполнил: Буц И.Д.
# Группа: АДЭУ-211
# E-mail: ButsID@mgpu.ru


a1 = int(input("a1="))
a2 = int(input("a2="))

# Переменная 'a_min' должна содержать минимум, 'a_max' - максимум
a_min = min(a1,a2)
a_max = max(a1,a2)
print("Максимальное значаение:",a_max)
print("Минимальное значаение:",a_min)
# Удалите комментарий и допишите код

# Удалите комментарий и допишите код

# --------------
# Пример вывода:
#
# Введите первое число: 1
# Введите второе число: 2
# Максимум: 2, минимум: 1

# Введите первое число: 5
# Введите второе число: 5
# Максимум: 5, минимум: 5

# Введите первое число: 100
# Введите второе число: -1
# Максимум: 100, минимум: -1
